# Live 015 - Como coletar Dados com SQL e Python

# 1.0. Acess Postgres Database with Terminal

In [ ]:
# Instalar PSQL - Iteractive
psql

# Comands
psql -h  -U USERNAME -d DATABASENAME 
psql -h 
psql -h comunidade-ds-postgres.c50pcakiuwi3.us-east-1.rds.amazonaws.com \
     -p 5432 \
     -d comunidadedsdb \
     -U member \
     -W cdspa

# Main Commands
## List Schemas
\dn

## List all tables in a schema
\dt pa004.*

## List all tables in a schema + memory information
\dt+ pa004.*

## get data from tables
select * from pa004.users limit 10;

## get all data
select * from pa004.users u INNER JOIN pa004.vehicle v ON (u.id=v.id) limit 10;

## exit database connection 
\q

# 2.0. Acess Postgres Database with DBeaver

## 2.1. Check Database

In [ ]:
# Check Schemas
"""
    SELECT nspname
    FROM pg_catalog.pg_namespace
"""

# Check Tables
"""
    SELECT tablename
    FROM  pg_tables
    WHERE schemaname='pa004'
"""

# Query Tables
"""
    SELECT *
    FROM  pa004.users
    LIMIT 10;
"""

# Query Tables with Joins
"""
    SELECT *
    FROM 
        pa004.users u INNER JOIN pa004.vehicle v   ON ( u.id = v.id )
                      INNER JOIN pa004.insurance i ON ( u.id = i.id )
    LIMIT 10

"""

# 3.0. Acess Postgres Database by Python

In [1]:
# Install libraries
# pip install psycopg2-binary
#
#

## 3.1. Libraries

In [17]:
import pandas   as pd
import pandas.io.sql as psql

import psycopg2 as pg

## 3.2. Credentials

In [3]:
host = 'comunidade-ds-postgres.c50pcakiuwi3.us-east-1.rds.amazonaws.com'
port = 5432
database = 'comunidadedsdb'
username = 'member'
pwd = 'cdspa'

## 3.3. Check Database

In [15]:
# Connect to an existing dataset
conn = pg.connect( user = username,
                   password = pwd,
                   host = host,
                   port = port,
                   database = database )

## 3.4. Check Schemas

In [45]:
# Create a cursor to perfor database operations
cursor = conn.cursor()

# Take a look at Schemas
query_schema = """
    SELECT nspname
    FROM pg_catalog.pg_namespace
"""
cursor.execute( query_schema )

record = cursor.fetchall()
print( record )

# connection close
cursor.close()
conn.close()

[('pg_toast',), ('pg_temp_1',), ('pg_toast_temp_1',), ('pg_catalog',), ('information_schema',), ('public',), ('pa004',)]

## 3.5. Check Tables

In [47]:
# Create a cursor to perfor database operations
cursor = conn.cursor()

# Take a look at Schemas
query_tables = """
    SELECT tablename
    FROM  pg_tables
    WHERE schemaname='pa004'
"""
cursor.execute( query_tables )

record = cursor.fetchall()
print( record )

# connection close
cursor.close()
conn.close()

[('users',), ('vehicle',), ('insurance',)]

## 3.6. Collect Data with Psycopg2

In [5]:
# Create a cursor to perfor database operations
cursor = conn.cursor()

# Take a look at Schemas
query_table_users = """
    SELECT *
    FROM  pa004.users
    LIMIT 10;
"""
cursor.execute( query_table_users )

record = cursor.fetchall()
print( record )

# connection close
cursor.close()
conn.close()

[(1, 'Male', 44, 28.0, 26.0), (2, 'Male', 76, 3.0, 26.0), (3, 'Male', 47, 28.0, 26.0), (4, 'Male', 21, 11.0, 152.0), (5, 'Female', 29, 41.0, 152.0), (6, 'Female', 24, 33.0, 160.0), (7, 'Male', 23, 11.0, 152.0), (8, 'Female', 56, 28.0, 26.0), (9, 'Female', 24, 3.0, 152.0), (10, 'Female', 32, 6.0, 152.0)]

In [12]:
data = pd.DataFrame( record )
data.columns = ['id', 'gender', 'idade', 'A', 'B']

In [13]:
data

   id  gender  idade     A      B
0   1    Male     44  28.0   26.0
1   2    Male     76   3.0   26.0
2   3    Male     47  28.0   26.0
3   4    Male     21  11.0  152.0
4   5  Female     29  41.0  152.0
5   6  Female     24  33.0  160.0
6   7    Male     23  11.0  152.0
7   8  Female     56  28.0   26.0
8   9  Female     24   3.0  152.0
9  10  Female     32   6.0  152.0

# 4.0. Collect Data with Pandas

In [19]:
query_users = """
    SELECT *
    FROM pa004.users
    LIMIT 10
"""

df = psql.read_sql( 'SELECT * FROM pa004.users LIMIT 10', conn )
df

   id  gender  age  region_code  policy_sales_channel
0   1    Male   44         28.0                  26.0
1   2    Male   76          3.0                  26.0
2   3    Male   47         28.0                  26.0
3   4    Male   21         11.0                 152.0
4   5  Female   29         41.0                 152.0
5   6  Female   24         33.0                 160.0
6   7    Male   23         11.0                 152.0
7   8  Female   56         28.0                  26.0
8   9  Female   24          3.0                 152.0
9  10  Female   32          6.0                 152.0

# 5.0. Raw Data

In [32]:
query_data = """
    SELECT *
    FROM 
        pa004.users u INNER JOIN pa004.vehicle v   ON ( u.id = v.id )
                      INNER JOIN pa004.insurance i ON ( u.id = i.id )
    LIMIT 10
"""

df = psql.read_sql( query_data, conn )
df_raw = df.drop( df.columns[[5, 9]],axis=1)

# connection close
cursor.close()
conn.close()

In [33]:
df_raw

,gender,age,region_code,policy_sales_channel,driving_license,vehicle_age,vehicle_damage,previously_insured,annual_premium,vintage,response
0,Male,26,28.0,152.0,1,< 1 Year,No,1,40994.0,240,0
1,Male,59,28.0,26.0,1,1-2 Year,Yes,1,34383.0,213,0
2,Male,24,36.0,152.0,1,< 1 Year,Yes,0,41164.0,257,0
3,Male,24,29.0,152.0,1,< 1 Year,No,1,56025.0,257,0
4,Female,44,28.0,124.0,1,1-2 Year,No,0,52973.0,275,0
5,Female,78,28.0,124.0,1,> 2 Years,Yes,0,35980.0,93,1
6,Female,44,3.0,26.0,0,1-2 Year,Yes,0,35644.0,272,1
7,Female,55,28.0,26.0,1,1-2 Year,No,1,86606.0,19,0
8,Female,24,30.0,151.0,1,< 1 Year,No,1,38578.0,222,0
9,Male,22,50.0,152.0,1,< 1 Year,No,1,37635.0,63,0